app/Domestic/Files/4/GetFlightDetailRQ.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetFlightDetail xmlns="http://booking.us.dev/">
            <strUserId xmlns="">ASIANL</strUserId>
            <strFlightId xmlns="">20bad2d4-1daf-473e-a862-1701ed1719ad</strFlightId>
        </GetFlightDetail>
    </Body>
</Envelope